import re

import pandas as pd

# df=pd.read_csv(r"D:\Pythonnnn\弱监督的农业社会化销售服务评价\data\红心柚\final2.csv")
df=pd.read_csv(r"D:\Pythonnnn\弱监督实验\原始数据\红心柚\新增差评依存得分.csv")

# df_culidu=pd.read_csv(r"D:\Pythonnnn\弱监督的农业社会化销售服务评价\data\红心柚\分词后_无停用词_空格.csv")

# pingFen=df_culidu["评分"].values




dim0=[]
dim1=[]
dim2=[]
dim3=[]
dim4=[]
dim5=[]
dim6=[]
#粗粒度
dim7=[]

#当前进行到第几行了
row=0
wuxiao=0
wuxiao_row=[]
# "{'品质': 1, '味道': 1, '价格': 0, '分量': 2, '包装': 2, '物流': 2, '客服': 1}"
def trans(text):
    global row
    global wuxiao
    pattern = r"\d"
    #查找字符串中的所有数字，放到数组中。如果正则写作\d+，则匹配所有的字符串
    num_list = re.findall(pattern, text)
    # print(num_list)

    # if "1" not in num_list and "0" not in num_list:
    #     wuxiao+=1
    #     print(df["comments"][row])
    #     wuxiao_row.append(row)

    #如果细粒度有0也有1，则粗粒度是矛盾
    if text.find("0")>=0 and text.find("1")>=0:
        dim7.append(1)
    #如果细粒度有0、2.没有1，那么是差评
    elif text.find("0")>=0:
        dim7.append(0)
    #否则是好评（包括全2情况）
    else:
        dim7.append(2)
    # #剩下的情况，按照用户评分划分
    # else:
    #     if pingFen[row]>=4:
    #         dim7.append(2)
    #     else:
    #         dim7.append(0)
    # dim7.append(pingFen[row])
    #
    dim0.append(num_list[0])
    dim1.append(num_list[1])
    dim2.append(num_list[2])
    dim3.append(num_list[3])
    dim4.append(num_list[4])
    dim5.append(num_list[5])
    dim6.append(num_list[6])
    #
    row+=1



df.value.apply(trans)


df2 = pd.DataFrame(data={'评论':df["comments"],'品质': dim0, '味道': dim1, '价格': dim2, '分量': dim3, '外观': dim4, '物流': dim5, '客服': dim6,'粗粒度':dim7})
# # df2.to_excel(r"D:\Pythonnnn\弱监督的农业社会化销售服务评价\data\红心柚\弱标签评论集22.xlsx",index=False)
df2.to_csv(r"D:\Pythonnnn\弱监督实验\原始数据\红心柚\新增差评最终形式.csv",index=False)


# index_to_drop=[55, 86, 99, 100, 115, 119, 125, 147, 155, 180, 205, 262, 285, 293, 335, 377, 854, 1001, 1049, 1144, 1308, 1309, 1360, 1411, 1427, 1435, 1461, 2402, 2545, 3252, 3408, 3489, 3490, 3530, 3540, 3541, 3556, 3611, 3632, 3645, 3704, 3705, 3706, 3730, 3737, 3751, 3808, 3809, 3813, 3849, 3859, 3869, 3930, 3976, 3977, 3994, 4051, 4062, 4195, 4434, 4441, 4446, 4486, 4513, 4526, 4624, 4659, 4717, 4911, 4919, 4986, 5018, 5072, 5076, 5082, 5134, 5171, 5191, 5222, 5239, 5317, 5396, 5415, 5516, 5605, 5635, 5645, 5661, 5688, 5704, 5707, 5711, 5733, 5776, 5827, 5847, 5872, 5938, 5964, 5971, 6017, 6056, 6094, 6100, 6102, 6104, 6106, 6108, 6208, 6250, 6276, 6279, 6281, 6297, 6319, 6322, 6334, 6364, 6383, 6387, 6388, 6472, 6488, 6508, 6527, 6540, 6541, 6566, 6577, 6623, 6643, 6662, 6665, 6677, 6680, 6682, 6690, 6706, 6711, 6747, 6758, 6764, 6769, 6776, 6804, 6817, 6818, 6828, 6839, 6860, 6880, 6921, 6989, 7021, 7044, 7045, 7046, 7070, 7092, 7225, 7233, 7238, 7243, 7253, 7278, 7288, 7317, 7319, 7409, 7528, 7534, 7549, 7554, 7556, 7686, 7741, 7767, 7824, 7938, 7947, 7998, 8011, 8029, 8033, 8081, 8105, 8134, 8164, 8199, 8216, 8237, 8244, 8296, 8297, 8309, 8320, 8321, 8454, 8455, 8457, 8473, 8514, 8542, 8571, 8576, 8590, 8623, 8640, 8641, 8698, 8800, 8811, 8813, 8837, 8894, 8922, 8952, 8964, 9008, 9011, 9013, 9015, 9035, 9091, 9118, 9181, 9221, 9248, 9267, 9268, 9274, 9298, 9307, 9308, 9315, 9319, 9321, 9332, 9366, 9386, 9403]
# df2 = df2.drop(index_to_drop)
# df2.to_csv("D:\Pythonnnn\弱监督的农业社会化销售服务评价\data\红心柚\弱标签评论集_去除全2_修正粗负.csv",index=False)


# print(f"无效个数{wuxiao}")
# print(str(wuxiao_row))